<head>
  <meta name="author" content="Rogério de Oliveira">
  <meta institution="author" content="Universidade Presbiteriana Mackenzie">
</head>

<img src="http://meusite.mackenzie.br/rogerio/mackenzie_logo/UPM.2_horizontal_vermelho.jpg" width=300, align="right"> 

<h1 align=left><font size = 8, style="color:rgb(200,0,0)"><b>Ciência de Dados </b></font></h1> 
<h1 align=left><font size = 5, style="color:rgb(0,0,0)"><b>Paradigmas de Linguagens de
Programação para Ciência de Dados</b></font></h1> 

# 2 Seleção e Organização de Dados com Pandas
Professores: *Diego Nogare* & *Rogério de Oliveira* 

<br>
<br>

---

# Exercícios

Nos exercícios a seguir emprege a base de dados `titanic`.

Todos exercícios possuem várias soluções possíveis, mas não se preocupe com isso. A melhor solução é primeiro, a que funciona para você!

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
from random import choices

titanic = sns.load_dataset('titanic')
titanic.head()

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

1. Qual a quantidade de linhas e colunas de `titanic`?

In [3]:
titanic.shape

(891, 15)

2. Qual a idade do passageiro mais velho?

In [4]:
titanic.nlargest(1, 'age')

     survived  pclass   sex   age  ...  deck  embark_town  alive alone
630         1       1  male  80.0  ...     A  Southampton    yes  True

[1 rows x 15 columns]

3. Qual a idade da sobrevivente feminina mais velha?

In [7]:
titanic_female = titanic[titanic.sex == 'female']
titanic_female.nlargest(1, 'age')

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
275         1       1  female  63.0  ...     D  Southampton    yes  False

[1 rows x 15 columns]

4. Qual o percentual de sobreviventes da primeira e terceira classes?

In [20]:
titanic.rename(columns={'class': 'serviceClass'}, inplace = True)

In [39]:
titanicPrimeira = titanic[titanic.serviceClass == 'First']
totalSobreviventesPrimeira = titanicPrimeira['survived'].sum() 
print(f'Percentual de sobreviventes da primeira classe {(totalSobreviventesPrimeira*100) / len(titanicPrimeira) :.2f} %')

Percentual de sobreviventes da primeira classe 62.96 %

In [38]:
titanicTerceira = titanic[titanic.serviceClass == 'Third']
totalSobreviventesTerceira = titanicTerceira['survived'].sum() 
print(f'Percentual de sobreviventes da terceira classe {(totalSobreviventesTerceira*100) / len(titanicTerceira) :.2f} %')

Percentual de sobreviventes da terceira classe 24.24 %

5. Analise a média de idade dos passageiros por classe e sexo (sugestão: empregue groupby). Você pode notar que?

In [40]:
#média de idade agrupando por classe e sexo.


display(titanic.groupby(['serviceClass','sex']).agg('mean','std'))

                     survived  pclass  ...  adult_male     alone
serviceClass sex                       ...
First        female  0.968085     1.0  ...    0.000000  0.361702
             male    0.368852     1.0  ...    0.975410  0.614754
Second       female  0.921053     2.0  ...    0.000000  0.421053
             male    0.157407     2.0  ...    0.916667  0.666667
Third        female  0.500000     3.0  ...    0.000000  0.416667
             male    0.135447     3.0  ...    0.919308  0.760807

[6 rows x 8 columns]